import pytest

from src.widget import get_date, mask_account_card


@pytest.mark.parametrize(
    "value, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Maestro 15968378687051", "Номер карты введен неверно"),
        ("Maestro fsdaf", "Номер карты введен неверно"),
        ("Maestro ", "Номер введен неверно"),
        ("Ma ", "Номер введен неверно"),
        ("Maestro 15968378687051994567", "Номер карты введен неверно"),
        ("Maestro 1dd6837868705199", "Номер карты введен неверно"),
        ("Счет 64686473678894779589", "Счет **9589"),
        ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
        ("Visa Platinum 8990922113665229", "Visa Platinum 8990 92** **** 5229"),
        ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
        ("Visa Gold 59994142284263", "Номер карты введен неверно"),
        ("Visa Gold 59994142284263231", "Номер карты введен неверно"),
        ("Счет 73654108430135874305", "Счет **4305"),
        ("Счет ff654108430135874305", "Номер счета введен неверно"),
        ("Счет 45421", "Номер счета введен неверно"),
        ("Счет ", "Номер введен неверно"),
        ("Счт", "Номер введен неверно"),
        ("", "Номер введен неверно"),
    ],
)
def test_mask_account_card(value, expected):
    """Тест функции, которая определяет входной аргумент и маскирует его, в зависимости от данных"""
    assert mask_account_card(value) == expected


def test_get_date():
    """Тест функции изменения формата даты"""
    assert get_date("2024-03-11T02:26:18.671407") == "03.11.2024"

    assert get_date("2024-03-1102:26:18.671407") == "Введен неверный формат даты"

    assert get_date("20-24-03-11T02:26:18.671407") == "Введен неверный формат даты"
